[
    {
      "country": "Italy",
      "name": "Margherita Pizza",
      "ingredients": [
        "Pizza dough",
        "Tomato sauce",
        "Fresh mozzarella cheese",
        "Fresh basil leaves",
        "Extra-virgin olive oil",
        "Salt"
      ],
      "instructions": "1. Preheat your oven to the highest setting. 2. Roll out the pizza dough. 3. Spread tomato sauce evenly over the dough. 4. Tear the mozzarella into pieces and place them over the sauce. 5. Sprinkle with salt and drizzle with olive oil. 6. Bake until the crust is golden and the cheese is bubbly. 7. Top with fresh basil leaves before serving.",
      "email": "example@example.com",
      "name_sender": "Giulia Bianchi"
    },
    {
      "country": "Japan",
      "name": "Sushi Rolls",
      "ingredients": [
        "Sushi rice",
        "Nori seaweed",
        "Assorted fish (e.g., tuna, salmon)",
        "Avocado",
        "Cucumber",
        "Soy sauce",
        "Wasabi",
        "Pickled ginger"
      ],
      "instructions": "1. Cook sushi rice according to package instructions. 2. Lay a sheet of nori seaweed on a bamboo mat. 3. Spread a layer of rice over the nori, leaving a small border. 4. Add strips of fish, avocado, and cucumber. 5. Roll the sushi tightly using the bamboo mat. 6. Slice into bite-sized pieces. 7. Serve with soy sauce, wasabi, and pickled ginger.",
      "email": "example@example.com",
      "name_sender": "Yuki Tanaka"
    },
    {
      "country": "Mexico",
      "name": "Guacamole",
      "ingredients": [
        "Ripe avocados",
        "Tomato",
        "Onion",
        "Lime juice",
        "Cilantro",
        "Salt",
        "Garlic"
      ],
      "instructions": "1. Cut the avocados in half and remove the pit. 2. Scoop the avocado flesh into a bowl and mash with a fork. 3. Dice the tomato, onion, and garlic. 4. Chop the cilantro. 5. Mix the diced vegetables and cilantro into the mashed avocado. 6. Add lime juice and salt to taste. 7. Serve immediately with tortilla chips.",
      "email": "example@example.com",
      "name_sender": "Carlos Hernandez"
    },
    {
      "country": "France",
      "name": "Coq au Vin",
      "ingredients": [
        "Chicken thighs",
        "Bacon",
        "Onion",
        "Carrots",
        "Garlic",
        "Red wine",
        "Chicken broth",
        "Thyme",
        "Bay leaves",
        "Flour",
        "Butter",
        "Salt",
        "Pepper"
      ],
      "instructions": "1. Season chicken thighs with salt and pepper, then dredge in flour. 2. In a large skillet, cook bacon until crispy. 3. Remove bacon, leaving grease in the skillet. 4. Brown chicken thighs in the bacon grease. 5. Remove chicken and sauté onions, carrots, and garlic until softened. 6. Deglaze the skillet with red wine, scraping up any browned bits. 7. Return chicken and bacon to the skillet. 8. Add chicken broth, thyme, and bay leaves. 9. Simmer until chicken is cooked through and sauce is thickened. 10. Serve hot.",
      "email": "example@example.com",
      "name_sender": "Élodie Dubois"
    },
    {
      "country": "India",
      "name": "Chicken Tikka Masala",
      "ingredients": [
        "Chicken breast",
        "Yogurt",
        "Lemon juice",
        "Garlic",
        "Ginger",
        "Garam masala",
        "Paprika",
        "Cumin",
        "Coriander",
        "Tomato sauce",
        "Cream",
        "Butter",
        "Salt",
        "Cilantro"
      ],
      "instructions": "1. Marinate chicken breast in yogurt, lemon juice, minced garlic, minced ginger, garam masala, paprika, cumin, coriander, and salt. 2. Thread chicken onto skewers and grill until cooked through. 3. In a separate pan, melt butter and sauté minced garlic and ginger. 4. Add tomato sauce, cream, and salt. 5. Simmer until the sauce thickens. 6. Add grilled chicken to the sauce. 7. Serve hot, garnished with chopped cilantro.",
      "email": "example@example.com",
      "name_sender": "Raj Patel"
    },
    {
      "country": "China",
      "name": "Kung Pao Chicken",
      "ingredients": [
        "Chicken thigh",
        "Soy sauce",
        "Rice vinegar",
        "Sesame oil",
        "Cornstarch",
        "Sugar",
        "Garlic",
        "Ginger",
        "Dried red chilies",
        "Green onions",
        "Peanuts"
      ],
      "instructions": "1. Cut chicken thighs into bite-sized pieces and marinate in soy sauce, rice vinegar, sesame oil, and cornstarch. 2. In a wok or skillet, heat oil over high heat. 3. Add minced garlic, ginger, and dried red chilies. Stir-fry until fragrant. 4. Add marinated chicken and stir-fry until cooked through. 5. Add sugar and peanuts. 6. Cook until sauce thickens. 7. Garnish with chopped green onions. 8. Serve hot with rice.",
      "email": "example@example.com",
      "name_sender": "Li Chen"
    },
    {
      "country": "Greece",
      "name": "Greek Salad",
      "ingredients": [
        "Tomatoes",
        "Cucumber",
        "Red onion",
        "Kalamata olives",
        "Feta cheese",
        "Olive oil",
        "Red wine vinegar",
        "Dried oregano",
        "Salt",
        "Pepper"
      ],
      "instructions": "1. Chop tomatoes, cucumber, and red onion into bite-sized pieces. 2. Pit and halve kalamata olives. 3. Crumble feta cheese. 4. Combine chopped vegetables, olives, and feta cheese in a large bowl. 5. Drizzle with olive oil and red wine vinegar. 6. Season with dried oregano, salt, and pepper. 7. Toss to combine. 8. Serve chilled.",
      "email": "example@example.com",
      "name_sender": "Nikos Papadopoulos"
    },
    {
      "country": "Thailand",
      "name": "Pad Thai",
      "ingredients": [
        "Rice noodles",
        "Chicken, tofu, or shrimp",
        "Bean sprouts",
        "Green onions",
        "Garlic",
        "Tamarind paste",
        "Fish sauce",
        "Soy sauce",
        "Eggs",
        "Lime",
        "Peanuts",
        "Chili flakes"
      ],
      "instructions": "1. Soak rice noodles in warm water until softened, then drain. 2. In a wok or large skillet, heat oil over medium-high heat. 3. Add minced garlic and protein of choice (chicken, tofu, or shrimp). 4. Stir-fry until protein is cooked through. 5. Push protein to one side of the wok and crack eggs into the empty space. Scramble until cooked. 6. Add soaked rice noodles to the wok along with tamarind paste, fish sauce, soy sauce, and a squeeze of lime juice. 7. Stir-fry until noodles are heated through and well coated with sauce. 8. Add bean sprouts and chopped green onions. 9. Serve hot, garnished with crushed peanuts and chili flakes.",
      "email": "example@example.com",
      "name_sender": "Suthon Phan"
    },
    {
      "country": "Spain",
      "name": "Paella",
      "ingredients": [
        "Short-grain rice",
        "Chicken thighs",
        "Chorizo",
        "Shrimp",
        "Mussels",
        "Onion",
        "Red bell pepper",
        "Tomato",
        "Garlic",
        "Saffron threads",
        "Paprika",
        "Chicken broth",
        "Olive oil",
        "Salt",
        "Pepper"
      ],
      "instructions": "1. Heat olive oil in a large paella pan. 2. Add chopped onion, red bell pepper, and minced garlic. Sauté until softened. 3. Add sliced chorizo and chicken thighs. Brown on all sides. 4. Stir in diced tomato, saffron threads, and paprika. 5. Add short-grain rice and stir to coat in the oil and spices. 6. Pour in chicken broth and bring to a simmer. 7. Arrange shrimp, mussels, and any other seafood on top of the rice. 8. Cover and simmer until the rice is cooked and the seafood is done. 9. Season with salt and pepper. 10. Serve hot straight from the pan.",
      "email": "example@example.com",
      "name_sender": "Ana García"
    },
    {
      "country": "United States",
      "name": "Hamburger",
      "ingredients": [
        "Ground beef",
        "Hamburger buns",
        "Lettuce",
        "Tomato",
        "Onion",
        "Pickles",
        "Ketchup",
        "Mustard",
        "Mayonnaise",
        "Cheese slices",
        "Salt",
        "Pepper"
      ],
      "instructions": "1. Divide ground beef into equal portions and shape into patties. 2. Season patties with salt and pepper. 3. Preheat grill or skillet over medium-high heat. 4. Cook patties for about 4-5 minutes per side, or until desired doneness. 5. Toast hamburger buns on the grill or skillet. 6. Assemble hamburgers with lettuce, tomato, onion, pickles, and cheese slices. 7. Spread ketchup, mustard, and mayonnaise on the buns. 8. Serve hot.",
      "email": "example@example.com",
      "name_sender": "John Smith"
    },
    {
      "country": "India",
      "name": "Butter Chicken",
      "ingredients": [
        "Chicken thighs",
        "Yogurt",
        "Lemon juice",
        "Garlic",
        "Ginger",
        "Garam masala",
        "Paprika",
        "Cumin",
        "Coriander",
        "Tomato puree",
        "Butter",
        "Cream",
        "Cashews",
        "Salt",
        "Cilantro"
      ],
      "instructions": "1. Marinate chicken thighs in yogurt, lemon juice, minced garlic, minced ginger, garam masala, paprika, cumin, coriander, and salt. 2. Grill chicken until cooked through. 3. In a saucepan, melt butter and add minced garlic and ginger. 4. Stir in tomato puree, cream, and crushed cashews. 5. Simmer until the sauce thickens. 6. Add grilled chicken to the sauce. 7. Serve hot, garnished with chopped cilantro.",
      "email": "example@example.com",
      "name_sender": "Priya Patel"
    },
    {
      "country": "Japan",
      "name": "Miso Soup",
      "ingredients": [
        "Dashi stock",
        "Miso paste",
        "Tofu",
        "Green onions",
        "Wakame seaweed"
      ],
      "instructions": "1. Bring dashi stock to a simmer in a pot. 2. Dissolve miso paste in a small amount of hot dashi stock. 3. Add the dissolved miso paste to the pot of dashi stock. 4. Add cubed tofu and sliced green onions. 5. Simmer for a few minutes. 6. Add soaked wakame seaweed. 7. Serve hot.",
      "email": "example@example.com",
      "name_sender": "Takashi Yamamoto"
    },
    {
      "country": "Mexico",
      "name": "Tacos al Pastor",
      "ingredients": [
        "Pork shoulder",
        "Pineapple",
        "Corn tortillas",
        "Onion",
        "Cilantro",
        "Lime",
        "Achiote paste",
        "Garlic",
        "Oregano",
        "Vinegar",
        "Salt",
        "Pepper"
      ],
      "instructions": "1. Marinate thinly sliced pork shoulder in achiote paste, minced garlic, dried oregano, vinegar, salt, and pepper. 2. Skewer marinated pork with pineapple slices. 3. Grill until cooked through and slightly charred. 4. Slice grilled pork and pineapple. 5. Warm corn tortillas on the grill. 6. Assemble tacos with sliced pork, pineapple, diced onion, and chopped cilantro. 7. Serve hot with lime wedges.",
      "email": "example@example.com",
      "name_sender": "Alejandro González"
    },
    {
      "country": "Italy",
      "name": "Tiramisu",
      "ingredients": [
        "Ladyfingers",
        "Espresso",
        "Mascarpone cheese",
        "Eggs",
        "Sugar",
        "Cocoa powder"
      ],
      "instructions": "1. Brew strong espresso and let it cool. 2. In a mixing bowl, beat egg yolks with sugar until pale and creamy. 3. Add mascarpone cheese to the egg mixture and beat until smooth. 4. In a separate bowl, beat egg whites until stiff peaks form. 5. Gently fold the beaten egg whites into the mascarpone mixture. 6. Dip ladyfingers into the cooled espresso and arrange them in a single layer in a serving dish. 7. Spread half of the mascarpone mixture over the ladyfingers. 8. Repeat with another layer of dipped ladyfingers and mascarpone mixture. 9. Refrigerate for several hours or overnight to set. 10. Before serving, dust the top with cocoa powder.",
      "email": "example@example.com",
      "name_sender": "Giuseppe Rossi"
    },
    {
      "country": "France",
      "name": "Croissant",
      "ingredients": [
        "Flour",
        "Butter",
        "Milk",
        "Sugar",
        "Salt",
        "Yeast",
        "Eggs"
      ],
      "instructions": "1. Mix flour, sugar, salt, and yeast in a bowl. 2. Add warm milk and knead until a smooth dough forms. 3. Roll out the dough into a rectangle. 4. Spread softened butter over the dough. 5. Fold the dough into thirds like a letter. 6. Roll out the dough again and repeat the folding process. 7. Chill the dough for at least 1 hour. 8. Roll out the chilled dough and cut into triangles. 9. Roll each triangle into a croissant shape. 10. Let rise until doubled in size. 11. Brush with beaten egg. 12. Bake in a preheated oven until golden brown.",
      "email": "example@example.com",
      "name_sender": "Claire Dubois"
    },
    {
      "country": "China",
      "name": "Spring Rolls",
      "ingredients": [
        "Spring roll wrappers",
        "Cabbage",
        "Carrots",
        "Bean sprouts",
        "Shiitake mushrooms",
        "Garlic",
        "Ginger",
        "Soy sauce",
        "Oyster sauce",
        "Sesame oil",
        "Salt",
        "Pepper",
        "Oil for frying"
      ],
      "instructions": "1. Finely shred cabbage and carrots. 2. Slice shiitake mushrooms. 3. Heat oil in a wok or skillet. 4. Stir-fry minced garlic and ginger until fragrant. 5. Add shredded cabbage, carrots, bean sprouts, and sliced mushrooms. 6. Season with soy sauce, oyster sauce, sesame oil, salt, and pepper. 7. Cook until vegetables are softened. 8. Place a spoonful of the vegetable mixture onto a spring roll wrapper. 9. Roll up tightly, folding in the sides. 10. Seal the edge with water. 11. Deep-fry in hot oil until golden and crispy. 12. Drain on paper towels before serving.",
      "email": "example@example.com",
      "name_sender": "Li Wei"
    },
    {
      "country": "India",
      "name": "Paneer Tikka",
      "ingredients": [
        "Paneer (Indian cottage cheese)",
        "Bell peppers",
        "Onion",
        "Yogurt",
        "Ginger-garlic paste",
        "Garam masala",
        "Turmeric",
        "Chili powder",
        "Coriander powder",
        "Cumin powder",
        "Lemon juice",
        "Oil",
        "Salt",
        "Skewers"
      ],
      "instructions": "1. Cut paneer, bell peppers, and onions into cubes. 2. In a bowl, mix yogurt with ginger-garlic paste, garam masala, turmeric, chili powder, coriander powder, cumin powder, lemon juice, oil, and salt. 3. Marinate paneer, bell peppers, and onions in the yogurt mixture for at least 1 hour. 4. Thread marinated paneer and vegetables onto skewers. 5. Grill skewers until paneer is golden and vegetables are tender. 6. Serve hot with mint chutney.",
      "email": "example@example.com",
      "name_sender": "Amit Patel"
    },
    {
      "country": "Italy",
      "name": "Risotto",
      "ingredients": [
        "Arborio rice",
        "Chicken or vegetable broth",
        "Onion",
        "Garlic",
        "White wine",
        "Parmesan cheese",
        "Butter",
        "Olive oil",
        "Salt",
        "Pepper"
      ],
      "instructions": "1. Heat chicken or vegetable broth in a saucepan and keep it warm. 2. In a separate pan, heat olive oil and butter. 3. Sauté finely chopped onion and minced garlic until translucent. 4. Add arborio rice and toast until lightly golden. 5. Deglaze the pan with white wine and cook until absorbed. 6. Add a ladleful of warm broth to the rice and stir until absorbed. 7. Continue adding broth gradually, stirring frequently, until the rice is creamy and tender. 8. Stir in grated Parmesan cheese. 9. Season with salt and pepper to taste. 10. Serve hot.",
      "email": "example@example.com",
      "name_sender": "Giorgio Ferrari"
    },
    {
      "country": "Mexico",
      "name": "Chiles Rellenos",
      "ingredients": [
        "Poblano peppers",
        "Cheese (queso Oaxaca or mozzarella)",
        "Tomatoes",
        "Onion",
        "Garlic",
        "Eggs",
        "Flour",
        "Oil for frying",
        "Salt",
        "Pepper"
      ],
      "instructions": "1. Roast poblano peppers until charred. 2. Place peppers in a plastic bag and let steam for 10 minutes. 3. Peel off the charred skin, make a slit, and remove seeds. 4. Stuff each pepper with cheese. 5. In a blender, puree tomatoes, onion, and garlic. 6. Cook the tomato sauce in a skillet until thickened. 7. In a separate bowl, beat egg whites until stiff peaks form. 8. Gently fold in beaten egg yolks. 9. Dip stuffed peppers in flour, then in the egg mixture. 10. Fry in hot oil until golden brown. 11. Serve hot with tomato sauce.",
      "email": "example@example.com",
      "name_sender": "Alejandra Morales"
    },
    {
      "country": "Japan",
      "name": "Tempura",
      "ingredients": [
        "Shrimp",
        "Assorted vegetables (e.g., sweet potato, bell pepper, eggplant)",
        "Flour",
        "Cornstarch",
        "Egg",
        "Ice water",
        "Oil for frying",
        "Salt"
      ],
      "instructions": "1. Peel and devein shrimp, leaving the tails intact. 2. Cut vegetables into bite-sized pieces. 3. In a bowl, mix flour and cornstarch. 4. In another bowl, beat an egg and mix with ice water. 5. Combine the wet and dry ingredients, mixing until just combined (batter should be lumpy). 6. Heat oil in a deep fryer or large pot to 350°F (180°C). 7. Dip shrimp and vegetables into the batter, coating evenly. 8. Fry in batches until golden brown and crispy. 9. Drain on paper towels and sprinkle with salt. 10. Serve hot with dipping sauce.",
      "email": "example@example.com",
      "name_sender": "Yuki Tanaka"
    },
    {
      "country": "France",
      "name": "Quiche Lorraine",
      "ingredients": [
        "Pie crust",
        "Bacon",
        "Gruyère cheese",
        "Eggs",
        "Heavy cream",
        "Salt",
        "Pepper",
        "Nutmeg"
      ],
      "instructions": "1. Preheat oven to 375°F (190°C). 2. Roll out pie crust and press into a pie dish. 3. Cook bacon until crispy, then crumble or chop into pieces. 4. Sprinkle bacon and grated Gruyère cheese into the pie crust. 5. In a bowl, whisk together eggs, heavy cream, salt, pepper, and a pinch of nutmeg. 6. Pour the egg mixture over the bacon and cheese. 7. Bake for 30-35 minutes, or until the quiche is set and golden brown. 8. Allow to cool slightly before slicing and serving.",
      "email": "example@example.com",
      "name_sender": "Marie Dubois"
    },
    {
      "country": "India",
      "name": "Palak Paneer",
      "ingredients": [
        "Paneer (Indian cottage cheese)",
        "Spinach",
        "Tomatoes",
        "Onion",
        "Garlic",
        "Ginger",
        "Green chilies",
        "Cumin seeds",
        "Turmeric",
        "Garam masala",
        "Coriander powder",
        "Salt",
        "Oil",
        "Cream"
      ],
      "instructions": "1. Blanch spinach in boiling water for 2 minutes, then transfer to ice water. 2. Blend blanched spinach into a smooth puree. 3. Heat oil in a pan and fry paneer cubes until golden brown. 4. In the same pan, add cumin seeds and let them splutter. 5. Add finely chopped onions and sauté until golden brown. 6. Add minced garlic, ginger, and green chilies, and cook until fragrant. 7. Stir in chopped tomatoes and cook until softened. 8. Add turmeric, garam masala, coriander powder, and salt. 9. Pour in spinach puree and cook for a few minutes. 10. Stir in cream and cooked paneer cubes. 11. Simmer until flavors are blended. 12. Serve hot with rice or naan.",
      "email": "example@example.com",
      "name_sender": "Rajesh Patel"
    },
    {
      "country": "Italy",
      "name": "Caprese Salad",
      "ingredients": [
        "Tomatoes",
        "Fresh mozzarella cheese",
        "Fresh basil leaves",
        "Extra-virgin olive oil",
        "Balsamic vinegar",
        "Salt",
        "Pepper"
      ],
      "instructions": "1. Slice tomatoes and fresh mozzarella cheese into thick slices. 2. Arrange tomato and mozzarella slices alternately on a serving plate. 3. Tuck fresh basil leaves between the slices. 4. Drizzle with extra-virgin olive oil and balsamic vinegar. 5. Season with salt and pepper to taste. 6. Serve immediately.",
      "email": "example@example.com",
      "name_sender": "Giulia Bianchi"
    },
    {
      "country": "United States",
      "name": "Apple Pie",
      "ingredients": [
        "Pie crust",
        "Apples",
        "Sugar",
        "Brown sugar",
        "Flour",
        "Cinnamon",
        "Nutmeg",
        "Butter"
      ],
      "instructions": "1. Preheat oven to 425°F (220°C). 2. Roll out pie crust and press into a pie dish. 3. Peel, core, and slice apples. 4. In a large bowl, toss apple slices with sugar, brown sugar, flour, cinnamon, and nutmeg. 5. Pour apple mixture into the pie crust. 6. Dot the top with butter. 7. Cover with a second pie crust or lattice strips. 8. Crimp the edges to seal. 9. Brush the top crust with milk and sprinkle with sugar. 10. Bake for 45-50 minutes, or until the crust is golden brown and the filling is bubbly. 11. Allow to cool before slicing and serving.",
      "email": "example@example.com",
      "name_sender": "Mary Johnson"
    },
    {
      "country": "Thailand",
      "name": "Green Curry",
      "ingredients": [
        "Green curry paste",
        "Coconut milk",
        "Chicken or tofu",
        "Eggplant",
        "Bell peppers",
        "Bamboo shoots",
        "Thai basil leaves",
        "Fish sauce",
        "Sugar"
      ],
      "instructions": "1. In a pot, heat coconut milk and green curry paste until fragrant. 2. Add chicken or tofu and cook until browned. 3. Stir in sliced eggplant, bell peppers, and bamboo shoots. 4. Simmer until vegetables are tender. 5. Season with fish sauce and sugar to taste. 6. Stir in Thai basil leaves just before serving. 7. Serve hot with rice.",
      "email": "example@example.com",
      "name_sender": "Suthon Phan"
    },
    {
      "country": "France",
      "name": "Ratatouille",
      "ingredients": [
        "Eggplant",
        "Zucchini",
        "Bell peppers",
        "Onion",
        "Garlic",
        "Tomatoes",
        "Olive oil",
        "Thyme",
        "Basil",
        "Salt",
        "Pepper"
      ],
      "instructions": "1. Slice eggplant, zucchini, and bell peppers into rounds. 2. Thinly slice onion and mince garlic. 3. In a skillet, heat olive oil over medium heat. 4. Sauté onion and garlic until softened. 5. Add sliced vegetables to the skillet in layers, starting with eggplant, then zucchini, bell peppers, and tomatoes. 6. Season each layer with salt, pepper, thyme, and basil. 7. Cover and cook over low heat until vegetables are tender. 8. Serve hot or cold.",
      "email": "example@example.com",
      "name_sender": "Marie Dubois"
    },
    {
      "country": "India",
      "name": "Naan Bread",
      "ingredients": [
        "All-purpose  flour",
        "Yeast",
        "Sugar",
        "Yogurt",
        "Milk",
        "Oil",
        "Butter",
        "Garlic (optional)",
        "Coriander leaves (optional)"
      ],
      "instructions": "1. Dissolve yeast and sugar in warm milk and let it sit for 5-10 minutes until frothy. 2. In a large bowl, combine flour, yogurt, oil, and the yeast mixture. 3. Knead the dough until smooth and elastic. 4. Cover the dough and let it rise in a warm place for about 1-2 hours, or until doubled in size. 5. Preheat oven to the highest temperature setting with a pizza stone or baking sheet inside. 6. Divide the dough into equal portions and roll each portion into an oval shape. 7. Brush one side of the naan with water and place it on the hot pizza stone or baking sheet, wet side down. 8. Bake for 2-3 minutes, or until the naan puffs up and the bottom is golden brown. 9. Remove from the oven and brush with melted butter. 10. Optionally, sprinkle with minced garlic and chopped coriander leaves. 11. Serve hot.",
      "email": "example@example.com",
      "name_sender": "Amit Patel"
    },
    {
      "country": "Italy",
      "name": "Minestrone Soup",
      "ingredients": [
        "Vegetable broth",
        "Tomatoes",
        "Carrots",
        "Celery",
        "Onion",
        "Garlic",
        "Potatoes",
        "Zucchini",
        "Green beans",
        "Cannellini beans",
        "Pasta (e.g., small shells)",
        "Olive oil",
        "Salt",
        "Pepper",
        "Parmesan cheese"
      ],
      "instructions": "1. In a large pot, heat olive oil over medium heat. 2. Sauté chopped onion and minced garlic until softened. 3. Add diced carrots, celery, and potatoes. Cook until slightly tender. 4. Stir in chopped tomatoes and vegetable broth. 5. Bring to a boil, then reduce heat and simmer for about 15 minutes. 6. Add sliced zucchini, green beans, cannellini beans, and pasta. 7. Cook until pasta and vegetables are tender. 8. Season with salt and pepper to taste. 9. Serve hot with grated Parmesan cheese on top.",
      "email": "example@example.com",
      "name_sender": "Giorgio Ferrari"
    },
    {
      "country": "Japan",
      "name": "Tonkatsu",
      "ingredients": [
        "Pork loin or pork chops",
        "Flour",
        "Eggs",
        "Panko breadcrumbs",
        "Salt",
        "Oil for frying",
        "Tonkatsu sauce"
      ],
      "instructions": "1. Pound pork loin or pork chops to an even thickness. 2. Season with salt. 3. Dredge in flour, then dip in beaten eggs, and coat with panko breadcrumbs. 4. Heat oil in a deep fryer or large skillet to 350°F (180°C). 5. Fry pork until golden brown and cooked through. 6. Drain on paper towels. 7. Slice tonkatsu and serve with tonkatsu sauce.",
      "email": "example@example.com",
      "name_sender": "Takashi Yamamoto"
    },
    {
      "country": "France",
      "name": "Crème Brûlée",
      "ingredients": [
        "Heavy cream",
        "Egg yolks",
        "Sugar",
        "Vanilla extract",
        "Salt"
      ],
      "instructions": "1. Preheat oven to 300°F (150°C). 2. In a saucepan, heat heavy cream until it begins to simmer. 3. In a bowl, whisk together egg yolks, sugar, vanilla extract, and salt until pale and creamy. 4. Slowly pour the hot cream into the egg mixture, whisking constantly. 5. Strain the mixture through a fine sieve into a pouring jug. 6. Divide the mixture among ramekins. 7. Place ramekins in a baking dish and fill the dish with hot water halfway up the sides of the ramekins. 8. Bake for 40-45 minutes, or until the edges are set but the centers are still slightly jiggly. 9. Remove from the oven and let cool to room temperature. 10. Refrigerate for at least 2 hours, or until chilled and set. 11. Before serving, sprinkle a thin, even layer of sugar on top of each custard. 12. Use a kitchen torch to caramelize the sugar until it forms a crispy top. 13. Serve immediately.",
      "email": "example@example.com",
      "name_sender": "Claire Dubois"
    },
    {
      "country": "India",
      "name": "Samosa",
      "ingredients": [
        "Potatoes",
        "Peas",
        "Onion",
        "Garlic",
        "Ginger",
        "Green chilies",
        "Coriander leaves",
        "Cumin seeds",
        "Coriander powder",
        "Garam masala",
        "Turmeric",
        "Chili powder",
        "Salt",
        "Oil for frying",
        "Pastry dough"
      ],
      "instructions": "1. Boil potatoes until tender, then peel and roughly mash them. 2. In a skillet, heat oil and add cumin seeds. 3. Sauté finely chopped onion, minced garlic, minced ginger, and chopped green chilies until softened. 4. Add peas and cook for a few minutes. 5. Stir in mashed potatoes, coriander powder, garam masala, turmeric, chili powder, chopped coriander leaves, and salt. 6. Cook until the mixture is well combined and aromatic. 7. Roll out pastry dough and cut into circles. 8. Place a spoonful of the potato mixture in the center of each circle. 9. Fold the dough over the filling to form a triangle and seal the edges. 10. Heat oil in a deep fryer or large skillet. 11. Fry samosas until golden brown and crispy. 12. Drain on paper towels before serving.",
      "email": "example@example.com",
      "name_sender": "Priya Patel"
    },
    {
      "country": "Mexico",
      "name": "Mole",
      "ingredients": [
        "Dried chilies (e.g., ancho, pasilla, mulato)",
        "Onion",
        "Tomatoes",
        "Garlic",
        "Almonds",
        "Sesame seeds",
        "Raisins",
        "Chocolate",
        "Cinnamon",
        "Cloves",
        "Oregano",
        "Salt",
        "Chicken broth",
        "Oil"
      ],
      "instructions": "1. Remove stems and seeds from dried chilies. 2. Toast chilies in a dry skillet until fragrant, then soak in hot water until softened. 3. In the same skillet, toast sesame seeds, almonds, and cloves until golden. 4. Blend soaked chilies, toasted sesame seeds, almonds, cloves, chopped onion, tomatoes, garlic, raisins, chocolate, cinnamon, oregano, and salt until smooth, adding chicken broth as needed to achieve a thick sauce consistency. 5. Heat oil in a large pot and pour in the blended sauce. 6. Simmer over low heat, stirring frequently, until the sauce thickens and flavors meld, about 30-45 minutes. 7. Serve mole sauce over cooked chicken or turkey.",
      "email": "example@example.com",
      "name_sender": "Alejandro González"
    },
    {
      "country": "Thailand",
      "name": "Pad Thai",
      "ingredients": [
        "Rice noodles",
        "Chicken, tofu, or shrimp",
        "Bean sprouts",
        "Green onions",
        "Garlic",
        "Tamarind paste",
        "Fish sauce",
        "Soy sauce",
        "Eggs",
        "Lime",
        "Peanuts",
        "Chili flakes"
      ],
      "instructions": "1. Soak rice noodles in warm water until softened, then drain. 2. In a wok or large skillet, heat oil over medium-high heat. 3. Add minced garlic and protein of choice (chicken, tofu, or shrimp). 4. Stir-fry until protein is cooked through. 5. Push protein to one side of the wok and crack eggs into the empty space. Scramble until cooked. 6. Add soaked rice noodles to the wok along with tamarind paste, fish sauce, soy sauce, and a squeeze of lime juice. 7. Stir-fry until noodles are heated through and well coated with sauce. 8. Add bean sprouts and chopped green onions. 9. Serve hot, garnished with crushed peanuts and chili flakes.",
      "email": "example@example.com",
      "name_sender": "Suthon Phan"
    }
  ]
      
  